app/services/graph_builder.rb

    def call
      graph = RGL::DirectedAdjacencyGraph.new
      nodes = Node.all.map { |node| node.name }
---
SELECT "nodes".* FROM "nodes"

    def edge_values
      edge_values = {}
      edges = Edge.all
      edges.each do |edge|
---
SELECT "edges".* FROM "edges"