app/services/optimizations.rb

    def prim_cost(tree_edges_array)
      cost = 0
      Edge.all.each do |edge|
---
SELECT "edges".* FROM "edges"