app/services/tree_builder.rb

SELECT "edges".* FROM "edges"
SELECT "nodes".* FROM "nodes"
---
    def call(prim_array_edges)
      @edges_tree = []
      graph = RGL::AdjacencyGraph.new

      Edge.all.each do |edge|
        prim_array_edges.each do |e|
          if e.source == edge.source && e.target == edge.destiny
            @edges_tree << edge
          end
        end
      end
      nodes = Node.all.map(&:name)
      nodes.each do |node|