app/controllers/edges_controller.rb

SELECT "edges".* FROM "edges"
---
  def index
    @edges = Edge.all

SELECT "nodes".* FROM "nodes"
---
  def new
    @edge = Edge.new
    @nodes = Node.all
    @array = []
    @nodes.each do |node|

INSERT INTO "edges" ("name", "source", "destiny", "value") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", ""], ["source", "a"], ["destiny", "b"], ["value", 7]]
---
  def create
    @edge = Edge.new(edge_params)
    @nodes = Node.all

    respond_to do |format|
      if @edge.save

DELETE FROM "edges" WHERE "edges"."id" = $1  [["id", 1]]
---
  def destroy
    @edge.destroy

SELECT "edges".* FROM "edges" WHERE "edges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_edge
      @edge = Edge.find(params[:id])