app/controllers/nodes_controller.rb

  def index
    @nodes = Node.all
---
SELECT "nodes".* FROM "nodes"

  def create
    @node = Node.new(node_params)

    respond_to do |format|
      if @node.save
---
INSERT INTO "nodes" ("name") VALUES ($1) RETURNING "id"  [["name", "a"]]

  def destroy
    @node.destroy
---
DELETE FROM "nodes" WHERE "nodes"."id" = $1  [["id", 5]]

    def set_node
      @node = Node.find(params[:id])
---
SELECT "nodes".* FROM "nodes" WHERE "nodes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]